# ImportInstanceScale Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ImportInstanceScale Property
ParameterTypeId Class See Also
---
"Instance Scale"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ImportInstanceScale { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ImportInstanceScale As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ImportInstanceScale {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace